---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAlbedo
source: html/e2f44c01-49a7-59ba-0cea-ef56d5cc0d2f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAlbedo Property

The property labeled "Color" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceAlbedo { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.